#Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
#Пример:
#- 6782 -> 23
#- 0,56 -> 11



x = float(input('Enter any double number '))
#while(x % 10 != 0):  
    #x = x * 10 #получаем целое число c лишним нулем в десяткaх
# x /= 10
print(x)
#sum = 0.0
#while (x % 10 != 0):
#    sum += round(x % 10)
#    x /= 10
#print(sum)
